; domain
(define (domain gripper)
  (:requirements :strips :typing)
  (:types room ball gripper)

  (:predicates
    (at-robby ?r - room)
    (at ?b - ball ?r - room)
    (free ?g - gripper)
    (carry ?b - ball ?g - gripper)
  )

  ;; Action: Move the robot between rooms
  (:action move
    :parameters (?from ?to - room)
    :precondition (and (at-robby ?from))
    :effect (and (not (at-robby ?from))
                 (at-robby ?to))
  )

  ;; Action: Pick up a ball
  (:action pick
    :parameters (?b - ball ?r - room ?g - gripper)
    :precondition (and (at-robby ?r) (at ?b ?r) (free ?g))
    :effect (and (not (at ?b ?r))
                 (not (free ?g))
                 (carry ?b ?g))
  )

  ;; Action: Drop a ball
  (:action drop
    :parameters (?b - ball ?r - room ?g - gripper)
    :precondition (and (at-robby ?r) (carry ?b ?g))
    :effect (and (at ?b ?r)
                 (free ?g)
                 (not (carry ?b ?g)))
  )
)

; problem
(define (problem gripper-problem)
  (:domain gripper)

  (:objects
    room1 room2 - room
    ball1 ball2 ball3 ball4 - ball
    left right - gripper
  )

  (:init
    (at-robby room1)
    (at ball1 room1)
    (at ball2 room1)
    (at ball3 room1)
    (at ball4 room1)
    (free left)
    (free right)
  )

  (:goal
    (and (at ball1 room2)
         (at ball2 room2)
         (at ball3 room2)
         (at ball4 room2))
  )
)

; plan
1. (pick ball1 room1 right)
   deleted: (at ball1 room1) (free right)
   added: (carry ball1 right)
   goals met: 0 of 4
2. (move room1 room2)
   deleted: (at-robby room1)
   added: (at-robby room2)
   goals met: 0 of 4
3. (drop ball1 room2 right)
   deleted: (carry ball1 right)
   added: (at ball1 room2) (free right)
   goals met: 1 of 4
4. (move room2 room1)
   deleted: (at-robby room2)
   added: (at-robby room1)
   goals met: 1 of 4
5. (pick ball2 room1 right)
   deleted: (at ball2 room1) (free right)
   added: (carry ball2 right)
   goals met: 1 of 4
6. (move room1 room2)
   deleted: (at-robby room1)
   added: (at-robby room2)
   goals met: 1 of 4
7. (drop ball2 room2 right)
   deleted: (carry ball2 right)
   added: (at ball2 room2) (free right)
   goals met: 2 of 4
8. (move room2 room1)
   deleted: (at-robby room2)
   added: (at-robby room1)
   goals met: 2 of 4
9. (pick ball4 room1 left)
   deleted: (at ball4 room1) (free left)
   added: (carry ball4 left)
   goals met: 2 of 4
10. (move room1 room2)
   deleted: (at-robby room1)
   added: (at-robby room2)
   goals met: 2 of 4
11. (drop ball4 room2 left)
   deleted: (carry ball4 left)
   added: (at ball4 room2) (free left)
   goals met: 3 of 4
12. (move room2 room1)
   deleted: (at-robby room2)
   added: (at-robby room1)
   goals met: 3 of 4
13. (pick ball3 room1 right)
   deleted: (at ball3 room1) (free right)
   added: (carry ball3 right)
   goals met: 3 of 4
14. (move room1 room2)
   deleted: (at-robby room1)
   added: (at-robby room2)
   goals met: 3 of 4
15. (drop ball3 room2 right)
   deleted: (carry ball3 right)
   added: (at ball3 room2) (free right)
   goals met: 4 of 4
